In [1]:
people={
    "first":["Corey","Jane","John"],
    "last":["Schafer","Doe","Doe"],
    "email":["CoreyMSchafer@gmail.com","JaneDoe@email.com","JohnDoe@email.com"]
}

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [4]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [5]:
#rename column - all of the columns:
df.columns=["first_name","last_name","email"]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [6]:
#uppercasing all the column names:
#for y in df.columns:
    #print(y.upper())
    
df.columns=[x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [ ]:
#replace spaces with underscore:

In [7]:
df.columns=df.columns.str.replace("_"," ")
df.columns=df.columns.str.replace(" ","_")
df.columns=[x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [38]:
#only want to change certain columns:
df.rename(columns={"first_name":"first","last_name":"last"})

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [39]:
df
#method didn't go through - inplace=True

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [40]:
df.rename(columns={"first_name":"first","last_name":"last"},inplace=True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [42]:
#updating rows - single value ; loc and iloc

#changing john:
df.loc[2]=["John","Smith","JohnSmith@email.com"]

In [43]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [45]:
#specifying columns to change:
df.loc[2,["last","email"]]=["Doe","JohnDoe@email.com"]
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [46]:
#changing single value:
df.loc[2,"last"]="Smith"
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [47]:
#another indexer - at: meant for specifically changing and modifying rows
df.at[2,"last"]="King"
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John     King        JohnDoe@email.com

In [48]:
df.at[2,"last"]="Doe"
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [53]:
#common error - changing without indexer
#grab using filter:
filt=df["email"]=="JohnDoe@email.com"
df[filt]["last"] #grabbing the last name column where email is johndoe
df[filt]["last"]="Smith"
df #doesn't actually make the change - 
#this is because value is getting set on a temporary object which is getting tossed out immediately after

C:\Users\Aditi\AppData\Local\Temp\ipykernel_580\3933653146.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]["last"]="Smith"

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [54]:
df.loc[filt,"last"]="Smith"
df #works

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [57]:
#changing multiple rows in one column:
df["email"].str.lower() #doesn't actually make that change; only displays it
df["email"]=df["email"].str.lower()
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [58]:
#four methods - apply,map,applymap,replace
#apply - used for calling a function on values - works on series or df (diff behaviour for both)

df["email"].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [62]:
#using apply to update values: just an example; use previous method to upper
def update_email(email):
    return email.upper()

df["email"].apply(update_email)
df["email"]=df["email"].apply(update_email)
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [63]:
#lambda function - anonymous functions 
df["email"]=df["email"].apply(lambda x:x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [64]:
#can also use with numbers to run calculations
#running apply on a df - runs it on each row, and column
df["email"].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [65]:
df.apply(len) #doesn't apply len function to every value in the dataframe - function applied to each series/column

first    3
last     3
email    3
dtype: int64

In [68]:
df.apply(len,axis="columns") #counting no of attributes for each row

0    3
1    3
2    3
dtype: int64

In [ ]:
#get minimum value for each column: